      
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.vercel_project_directory.directory: Reading...
data.vercel_project_directory.directory: Read complete after 0s [id=../../../doppelgengar.dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vercel_deployment.deployment will be created
  + resource "vercel_deployment" "deployment" {
      + domains     = (known after apply)
      + files       = {
          + "../../../doppelgengar.dev/.eslintrc.json"      = "40~75e677e7192205173354ae9375c1d25ef78b0cec"
          + "../../../doppelgengar.dev/README.md"           = "1383~7186f4406725e6e20e302dd4d649698b641e8e3b"
          + "../../../doppelgengar.dev/next.config.mjs"     = "92~d242b535f61738790c7f8ca71ab7e6f31f8e66ca"
          + "../../../doppelgengar.dev/package-lock.json"   = "173775~1a535819b5c0694070f7599f478a85762ae47a10"
          + "../../../doppelgengar.dev/package.json"        = "557~6be0f5552b5595f77d389aa0afe4fede0fad7058"
          + "../../../doppelgengar.dev/postcss.config.js"   = "83~81781ed39dc8e6d6521ae1d63a67e46894acc2eb"
          + "../../../doppelgengar.dev/public/next.svg"     = "1375~3f3e95622612b989c5bd6a03299a308c6f3c7e6b"
          + "../../../doppelgengar.dev/public/vercel.svg"   = "629~38fefd5276208736eb9d43ecd50cee08bf56fbcd"
          + "../../../doppelgengar.dev/src/app/favicon.ico" = "25931~9ecfcc8f0ead0bf3d2d7c39e084b88f41cc89a2e"
          + "../../../doppelgengar.dev/src/app/globals.css" = "606~9974e75019d9652a45ed97cb336d2ea713665bba"
          + "../../../doppelgengar.dev/src/app/layout.tsx"  = "473~dd6dc5356919c823d496f7fb687bde54e870fc04"
          + "../../../doppelgengar.dev/src/app/page.tsx"    = "5843~219388ec3a203f245e8047ee6cedaa4419d5a78a"
          + "../../../doppelgengar.dev/tailwind.config.ts"  = "510~77c873fbb737425e5572f16ce9bc07b281b4b94c"
          + "../../../doppelgengar.dev/tsconfig.json"       = "578~71beb4ab458ca43ab89af60332005d5eeb310700"
        }
      + id          = (known after apply)
      + path_prefix = "../../../doppelgengar.dev"
      + production  = true
      + project_id  = (known after apply)
      + team_id     = (known after apply)
      + url         = (known after apply)
    }

  # vercel_project.portfolio will be created
  + resource "vercel_project" "portfolio" {
      + framework                               = "nextjs"
      + id                                      = (known after apply)
      + name                                    = "doppelgengar-portfolio"
      + protection_bypass_for_automation_secret = (known after apply)
      + serverless_function_region              = (known after apply)
      + team_id                                 = (known after apply)
      + vercel_authentication                   = {
          + protect_production = false
        }
    }

  # vercel_project_domain.apex will be created
  + resource "vercel_project_domain" "apex" {
      + domain     = "doppelgengar.dev"
      + id         = (known after apply)
      + project_id = (known after apply)
      + team_id    = (known after apply)
    }

  # vercel_project_domain.www will be created
  + resource "vercel_project_domain" "www" {
      + domain     = "www.doppelgengar.dev"
      + id         = (known after apply)
      + project_id = (known after apply)
      + team_id    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @DoppelG3ngar, Action: `pull_request`, Working Directory: `./terraform/environments/staging`, Workflow: `Pull request from feature branch`*